rottenpotatoes-rails-intro/app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.pluck('rating').uniq
    @sort_param = nil
    @filter_param = nil
    @Rating_from_filter = @all_ratings

    if(params[:sort] != nil)
      @sort_param = params[:sort]
    elsif session[:sort] !=nil
      @sort_param = session[:sort]
    else
      @sort_param = nil
    end

    if(params[:ratings] != nil)
        @filter_param = params[:ratings]
    elsif session[:ratings] !=nil
      @filter_param = session[:ratings]
    else
      @filter_param = nil
    end

    if @filter_param == nil
     @Rating_from_filter = @all_ratings
    else
     @Rating_from_filter = @filter_param
    end

    if(params[:ratings] == nil && session[:ratings] == nil )
      @movies = Movie.order(@sort_param)
    else
      @movies = Movie.where(:rating => @filter_param.keys).order(@sort_param)
---
SELECT DISTINCT "movies"."rating" FROM "movies"
SELECT "movies".* FROM "movies" WHERE "rating"."R" = '1' AND "rating"."PG-13" = '1'  ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "rating"."G" = '1' AND "rating"."R" = '1'  ORDER BY title